Repository: chris979712/HiveGameClient
Catalog: HiveGameClient/HiveGameWPFApp/Properties/Resources.*.resx
Languages: es_mx

# globalLbl_UserName
source: User name
es_mx: Nombre de usuario

# globalLbl_Password
source: Password
es_mx: Contraseña

# globalLbl_Email
source: Email
es_mx: Correo

# btn_Guest
source: Guest
es_mx: Invitado

# btn_Login
source: Log in
es_mx: Iniciar sesión

# btn_CreateAccount
source: Register
es_mx: Registrarse

# lbl_RecoverPassword
source: Forgot your password?
es_mx: ¿Olvidaste tu contraseña?

# dialogTitleError
source: An error has ocurred
es_mx: Un error ha ocurrido

# dialogTitleWarning
source: Warning
es_mx: Advertencia

# dialogTitleSucces
source: Operation succesfull
es_mx: Operación exitosa

# dialogTitleConfirmation
source: Action confirmation
es_mx: Confirmación de acción

# dialogEndPointException
source: Failed to find the endpoint. Please check the server configuration and try again.
es_mx: Fallo al encontrar el punto de acceso. Por favor cheque la configuración al servidor e inténtelo de nuevo.

# dialogComunicationException
source: Failed to establish a connection with the server. Please check your internet connection and try it again.
es_mx: Se ha producido un fallo para establecer la conexión al servidor. Cheque su conexión a internet e inténtelo de nuevo

# dialogTimeOutException
source: Try again waiting time has expired. Please check your connection to the server.
es_mx: El tiempo de espera ha caducado, inténtelo de nuevo. Por favor cheque su conexión a internet.

# dialogDataBaseError
source: An error has ocurred with the database, please try again.
es_mx: Ha ocurrido un error al intentar establecer conexión con la base de datos.

# dialogWrongData
source: The information that you type is incorrect, try it again.
es_mx: La información que ha ingresado es incorrecta. Intentelo de nuevo.

# dialogMissmatchesCredentials
source: Unable to find the account. Please verify to type the correct email and password.
es_mx: No se ha podido encontrar la cuenta. Por favor verifique que el nombre de usuario y contraseña sea correcto.

# dialogMessageJoinChat
source: has joined to the lobby. Give it a welcome!
es_mx: Se ha unido al chat. Denle una calida bienvenida!

# ConfirmationTitle
source: Action confirmation
es_mx: Confirmación de acción

# dialogMissmatchesPassword
source: Verify that the password that you typed are the same.
es_mx: Verifique que las contraseñas ingresadas sean identicas.

# dialogExistinAccount
source: The email or username to regist are already registered.
es_mx: El correo o nombre de usuario a registrar. Han sido registrados previamente.

# dialogAccountCreated
source: Your account has been successfully created. Welcome! :D
es_mx: Su cuenta ha sido creada exitosamente. Bienvenido! :D

# lbl_ConfirmPassword
source: Confirm Password
es_mx: Confirmar contraseña

# lbl_CreateAccount
source: Create Account
es_mx: Crear Cuenta

# lbl_EditProfile
source: Edit Profile
es_mx: Editar Perfil

# lbl_Nickname
source: Nickname
es_mx: Apodo

# lbl_Description
source: Description
es_mx: Descripción

# lbl_ProfilePicture
source: Profile Picture
es_mx: Imagen de perfil

# globalbtn_Confirm
source: Confirm
es_mx: Confirmar

# btn_Send
source: Send
es_mx: Enviar

# dialogExitMainMenu
source: You will return to the login window. Are you sure to exit?
es_mx: Regresará a la ventana de inicio de sesión. ¿Está seguro de salir?

# dialogSameDataProfileModification
source: There are no modifications to do, if you want to modify your profile, change any field.
es_mx: No hay modificaciones por hacer, si desea modificar su perfil, haga algún cambio en los campos.

# dialogUpdatedData
source: The information has been modified successfully.
es_mx: La información ha sido modificada exitosamente.

# lbl_EditCredentials
source: Edit credentials
es_mx: Editar credenciales

# lbl_CodeSendMessage
source: We have send a code to your email, please verify it and type it.
es_mx: Hemos enviado un código a su correo, por favor verifiquelo e introduzcalo.

# lbl_UserEmail
source: Email:
es_mx: Correo:

# txt_Timer
source: You can resend a new code in
es_mx: Podrás solicitar un código nuevo en

# lbl_NoReceivedCode
source: You didn't received the code?
es_mx: ¿No recibiste el código?

# lbl_ResendCode
source: Resend code
es_mx: Reenviar código

# lbl_NewPassword
source: New password
es_mx: Nueva contraseña

# globalbtn_Cancel
source: Cancel
es_mx: Cancelar

# dialogCouldntSendEmail
source: There has been an error while sending email message. Try it again.
es_mx: Se ha producido un error al enviar el mensaje de correo electrónico. Inténtalo de nuevo.

# dialogEmailVerificationMessage
source: Email sended. Please check your email account in order to see the verification code.
es_mx: Correo enviado. Por favor verifica tu cuenta de correo para poder ver el código de verificación.

# btn_Play
source: Play
es_mx: Jugar

# btn_MyAccount
source: My Account
es_mx: Mi cuenta

# btn_EditProfile
source: Edit Profile
es_mx: Editar Perfil

# btn_EditCredentials
source: Edit Credentials
es_mx: Editar Credenciales

# lbl_WrondVerificationCode
source: Wrong verification code
es_mx: Código de verificación incorrecto

# dialogEmailAlreadyRegistered
source: The email that you want to save, is already registered in another account.
es_mx: El correo que desea guardar, ya ha sido registrado previamente en otra cuenta.

# btn_GameFriends
source: Friend games
es_mx: Amigos del juego

# btn_FriendRequest
source: Friend requests
es_mx: Solicitudes de amistad

# btn_Add
source: Add friend
es_mx: Añadir amigo

# btn_Search
source: Search
es_mx: Buscar

# btn_Acept
source: Acept
es_mx: Aceptar

# btn_Decline
source: Decline
es_mx: Rechazar

# btn_GoBack
source: Go back
es_mx: Regresar

# btn_Friend
source: Friends
es_mx: Amistades

# dialogNoFriendsAdded
source: There are no friends added, try to find new friends. :D
es_mx: No hay amigos agregados, trata de encontrar algunos. :D

# dialogNoUsernameFound
source: The username that you type does not exist. Try again.
es_mx: El nombre de usuario que ingreso no existe. Intente de nuevo.

# dialogCanNotAddYourself
source: You can't add yourself as a friend.
es_mx: No te puedes agregar a ti mismo como amigo

# dialogNoFriendRequest
source: There are no friend requests to show.
es_mx: No hay solicitudes de amistad que seleccionar.

# dialogFriendRequestSended
source: The friend request has been sended succesfully.
es_mx: La solicitud de amistad se ha enviado de manera exitosa.

# dialogErrorAtObtainingUserData
source: Error at obtaining profile user data.
es_mx: Error al obtener los datos del perfil.

# dialogAcceptFriendRequest
source: The friend request has been accepted
es_mx: La solicitud de amistad ha sido aceptada.

# dialogDeclinedFriendRequest
source: The friend request has been decline.
es_mx: La solicitud de amistad ha sido rechazada.

# btn_Delete
source: Delete
es_mx: Eliminar

# dialogFriendDeleted
source: Your friend has been deleted
es_mx: Su amigo ha sido eliminado

# dialogConfirmFriendDelete
source: Are you sure to delete this friend?
es_mx: ¿Estás seguro de eliminar a este amigo?

# lbl_NoFriends
source: No friends added yet
es_mx: No hay amigos añadidos todavía

# btn_CreateMatch
source: Create match
es_mx: Crear partida

# btn_JoinMatch
source: Join match
es_mx: Unirse a una partida

# globalTxtb_PasswordIndications
source: Remember that your password must contain at least 8 characters. Including at least 1 number, 1 capital letter, 1 lowercase letter and 1 special character.
es_mx: Recuerda que tu contraseña debe contener al menos 8 caracteres. Incluyendo 1 letra mayúscula, 1 letra minúscula, 1 número y 1 caracter especial. Recuerda que no debe contener espacios en blanco.

# lbl_TitleRecoverPassword
source: Recover Password
es_mx: Recuperar contraseña

# globalLbl_PasswordIndications
source: Remeber that your password must contain at least 8 characters. Including at least 1 number, 1 capital letter, 1 lowercase letter and 1 special character.
es_mx: Recuerde que su contraseña debe incluir al menos 8 caracteres, incluyendo al menos 1 letra mayúscula, 1 letra minúscula, 1 número y 1 caracter especial.

# dialogNoPersonalLeaderboard
source: Couldn't find the specific personal leaderboard.
es_mx: No se pudo encontrar el marcador específico.

# dialogExistingSession
source: You can't join the game, the same account is playing on another device.
es_mx: No te puedes unir al juego, la misma cuenta se encuentra jugando en otro dispositivo.

# dialogCouldntFindUserSession
source: Couldn't find user session
es_mx: No se ha podido encontrar la sesión de usuario

# dialogErrorInDisconnection
source: Couldn't close users session, please try again.
es_mx: No se ha podido cerrar la sesión de usuario, inténtelo de nuevo.

# txtbl_Disconnected
source: Offline
es_mx: Desconectado

# txtbl_Online
source: Online
es_mx: Conectado

# globalDialog_PartialDisconnection
source: Partial discconnection, couldn´t disconnect the player at all.
es_mx: Desconexión parcial, no se pudo desconectar al jugador del todo.

# dialogCouldntLobbyDisconnection
source: Couldn't discconect the player from the lobby, try it again.
es_mx: No se ha podido desconectar al jugador del juego, inténtalo de nuevo.

# dialogConfirmLeaveLobby
source: Are you sure to leave the lobby?
es_mx: ¿Está seguro de abandonar la sala de espera?

# dialogConfirmationMatchCreation
source: Do you want to create a new match?
es_mx: ¿Desea crear una nueva partida?

# txtb_Host
source: Host
es_mx: Anfitrión

# txtb_HostName
source: Host name
es_mx: Nombre del anfitrión

# txtb_Guest
source: Guest
es_mx: Invitado

# txtb_GuestName
source: Guest name
es_mx: Nombre del invitado

# dialogNotExistingCode
source: The code for the match that you type, does not exist, verify and try it again.
es_mx: El código para la partida que ingreso, no existe, verifiquelo e inténtelo de nuevo.

# dialogFullLobby
source: Sorry, the lobby that you want to join is already full.
es_mx: Lo sentimos, la sala a la que te deseas unir, actualmente se encuentra llena.

# dialogHostHasLeft
source: The host of the lobby has left, you will be redirected to the main menu.
es_mx: El anfitrión del lobby ha salido. Será redirigido al menú principal.

# lbl_GameCode
source: Game Code
es_mx: Código

# btn_JoinTheGame
source: Join the game
es_mx: Unirse al juego

# lbl_Friends
source: Friends
es_mx: Amigos

# btn_Statistics
source: Statistics
es_mx: Estadística

# lbl_Statistics
source: Statistics
es_mx: Estadísticas

# lbl_World
source: World
es_mx: Mundial

# lbl_Name
source: Name
es_mx: Nombre

# lbl_Wins
source: Wins
es_mx: Victorias

# lbl_Losses
source: Losses
es_mx: Derrotas

# lbl_TotalGames
source: Total Games
es_mx: Partidas Totales

# lbl_RecoverYourPassword
source: Recover your password
es_mx: Recupera tu contraseña

# lbl_Music
source: Music
es_mx: Música

# lbl_Lenguage
source: Lenguage
es_mx: Idioma

# dialogEmailInvitationSend
source: The invitation has been send to the user selected.
es_mx: La invitación de partida ha sido enviada al usuario seleccionado.

# dialogMangerCouldntFindFriend
source: The person that you want to search is not online.
es_mx: La persona que desea buscar, no está en linea.

# dialogConfirmationKickPlayer
source: Are you sure to kick this player?
es_mx: ¿Está seguro de expulsar a este jugador?

# dialogYouveBeenKick
source: You have been kick from the lobby.
es_mx: Has sido expulsado de la sala.

# dialogCouldntFindUserAccount
source: We couldn´t find you user account, try to text the correct username or email.
es_mx: No hemos podido encontrar su cuenta, intente ingresar el nombre de usuario o correo correcto.

# btn_SendOffPlayer
source: Send off player
es_mx: Expulsar a un jugador

# btn_Start
source: Start
es_mx: Iniciar

# txtbl_Player1
source: Player One
es_mx: Jugador uno

# txtbl_Player2
source: Player Two
es_mx: Jugador Dos

# txtbl_TurnOf
source: Turn of:
es_mx: Turno de:

# dialogUserHasLeftTheMatch
source: An user has left the match, you will be redirected to the main menu.
es_mx: Un usuario ha abandonado la partida, será redirijido al menú principal.

# dialogManagerConfirmationLeaveMatch
source: Are you sure to leave the game?, your reputation will be affected.
es_mx: ¿Está seguro de abandonar la partida?, su reputación se verá afectada.

# dialogCouldntObtainPieceName
source: Couldn't obtain the type of piece to move
es_mx: No se ha podido obtener el tipo de pieza a mover.

# dialogBrokeHiveAlert
source: You can't move pieces that can break the hive into two parts.
es_mx: No puedes mover piezas que rompan la colmena en dos partes.

# dialogQueenIsNotInPlay
source: You have to place your Queen before or in the fourth turn, please select where to place it.
es_mx: Debes poner tu Reyna antes o en el cuarto turno. Por favor selecciona donde ponerla.
